//=============================================================================
// フォント処理 [font.cpp]
//
// Author : HAL東京昼間部 2年制ゲーム学科 GP11B341 24 中込和輝
// 作成日 : 2018/12/30
//=============================================================================


//*****************************************************************************
// インクルード
//*****************************************************************************
#include "quadrangle.h"
#include "font.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
// フォントへのポインタ
LPD3DXFONT fontDefault;
LPD3DXFONT fontImpact;


//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitFont(void)
{
	LPDIRECT3DDEVICE9 device = GetDevice();

	// ターミナル
	D3DXCreateFont(device,
		16,					// 高さ
		0,					// 幅
		FW_NORMAL,			// 太さ
		0,					// ミニマップ数
		FALSE,				// イタリック文字
		DEFAULT_CHARSET,	// フォントのタイプ
		OUT_DEFAULT_PRECIS,	// 出力精度
		DEFAULT_QUALITY,	// 出力品質
		DEFAULT_PITCH,		// フォントのピッチとファミリ
		_T(""),				// フォント名
		&fontDefault);


	// インパクト
	D3DXCreateFont(device,
		46,					// 高さ
		0,					// 幅
		FW_NORMAL,			// 太さ
		0,					// ミニマップ数
		FALSE,				// イタリック文字
		DEFAULT_CHARSET,	// フォントのタイプ
		OUT_DEFAULT_PRECIS,	// 出力精度
		DEFAULT_QUALITY,	// 出力品質
		DEFAULT_PITCH,		// フォントのピッチとファミリ
		_T("Impact"),		// フォント名
		&fontImpact);		

	return S_OK;
}


//=============================================================================
// 終了処理
//=============================================================================
void UninitFont(void)
{
	fontDefault->Release();
	fontImpact->Release();
}


//=============================================================================
// フォントを取得
//-----------------------------------------------------------------------------
// 戻り値：LPD3DXFONT　フォントへのポインタ
// 引数　：int font    取得したフォントの種類
//=============================================================================
LPD3DXFONT GetFont(int font)
{
	switch (font)
	{
	case DEFAULT_FONT:
		return fontDefault;
		break;

	case IMPACT:
		return fontImpact;
		break;
	}

	return NULL;
}