//=============================================================================
//
// アイテム処理 [item.h]
// Author : HAL東京昼間部 2年制ゲーム学科 GP11B341 24 中込和輝
//
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_


//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"


//*****************************************************************************
// マクロ・列挙型定義
//*****************************************************************************


//*****************************************************************************
// 構造体定義
//*****************************************************************************
// アイテム構造体
struct ITEM {
	LPDIRECT3DTEXTURE9			pTexture;					// テクスチャへのポインタ
	VERTEX_2D					vertexWk[NUM_VERTEX];		// 頂点情報格納ワーク
	D3DXVECTOR3					pos;						// 座標
	D3DXVECTOR3					rot;						// 回転
	BOOL						use;						// 使用か未使用か
	int							cntNonUseTime;				// 使用されていない時間をカウント
	int							sizeX;						// サイズX
	int							sizeY;						// サイズY
	D3DXVECTOR3					speed;						// 速度
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// アイテムの初期化処理
HRESULT InitItem(int type);
// アイテムの終了処理
void UninitItem(void);
// アイテムの更新処理
void UpdateItem(void);
// アイテムの描画処理
void DrawItem(void);
// ITEMの取得
ITEM *GetItem(void);
// 頂点カラーの設定
void SetColorItem(ITEM *item, D3DCOLOR setCol);	// 頂点カラーの設定

#endif