//=============================================================================
//
// ライフ処理 [life.h]
// Author : HAL東京昼間部 2年制ゲーム学科 GP11B341 24 中込和輝
//
//=============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_


//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"


//*****************************************************************************
// マクロ・列挙型定義
//*****************************************************************************
// ハートテクスチャの種類
enum HEART_TEX_TYPE
{
	FULL_HEART,
	HALF_HEART,
	BLANK_HEART,
};

#define	HEART_MAX		(3)		// ハートの数


//*****************************************************************************
// 構造体定義
//*****************************************************************************
// ハート構造体
struct HEART {
	VERTEX_2D			vertexWk[NUM_VERTEX];		// 頂点情報格納ワーク
	D3DXVECTOR3			pos;						// 座標
	D3DXVECTOR3			rot;						// 回転
	int					drawTex;					// 描画するテクスチャ
};

// ライフ構造体
struct GAMELIFE {
	LPDIRECT3DTEXTURE9	pTexHeart;					// テクスチャへのポインタ
	LPDIRECT3DTEXTURE9	pTexHalfHeart;				// テクスチャへのポインタ
	LPDIRECT3DTEXTURE9	pTexBlankHeart;				// テクスチャへのポインタ
	HEART				heart[HEART_MAX];			// ハート構造体
	D3DXVECTOR3			pos;						// 座標
	D3DXVECTOR3			rot;						// 回転
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// ライフの初期化処理
HRESULT InitLife(int type);
// ライフの終了処理
void UninitLife(void);
// ライフの更新処理
void UpdateLife(void);
// ライフの描画処理
void DrawLife(void);


#endif