//=============================================================================
//
// パンティ処理 [panty.h]
// Author : HAL東京昼間部 2年制ゲーム学科 GP11B341 24 中込和輝
//
//=============================================================================
#ifndef _PANTY_H_
#define _PANTY_H_


//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"


//*****************************************************************************
// マクロ・列挙型定義
//*****************************************************************************
#define TEXT_MAX				(256)

//*****************************************************************************
// 構造体定義
//*****************************************************************************
// パンティ構造体
struct GAMEPANTY {
	LPDIRECT3DTEXTURE9			pTexture;					// テクスチャへのポインタ
	VERTEX_2D					vertexWk[NUM_VERTEX];		// 頂点情報格納ワーク
	TCHAR						text[TEXT_MAX];				// 表示テキスト
	int							numPanty;					// パンティの数
	D3DXVECTOR3					pos;						// 座標
	D3DXVECTOR3					rot;						// 回転
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// パンティの初期化処理
HRESULT InitPanty(int type);
// パンティの終了処理
void UninitPanty(void);
// パンティの更新処理
void UpdatePanty(void);
// パンティの描画処理
void DrawPanty(void);
// パンティの数を追加
void AddNumPanty(void);



#endif