//=============================================================================
//
// 四角形処理 [quadrangle.h]
//
//=============================================================================
#ifndef _QUAD_H_
#define _QUAD_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"


//*****************************************************************************
// マクロ・列挙型定義
//*****************************************************************************


//*****************************************************************************
// 構造体定義
//*****************************************************************************
// 四角形２Ｄポリゴン構造体
typedef struct
{
	VERTEX_2D		vertexWk[NUM_VERTEX];	// 頂点情報格納ワーク
	TRANSFORM		transform;				// 座標変換
	float			centralAngle;			// 中心座標から４頂点への角度
	float			radius;					// 半径
	float			originalRadius;			// 元の半径
}QUADRANGLE;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 四角形２Ｄポリゴンの頂点情報を作成
HRESULT MakeVertexQuad(QUADRANGLE *quad);

// 四角形２Ｄポリゴンの頂点座標の設定
void SetVertexQuad(QUADRANGLE *quad);

// 四角形２Ｄポリゴン頂点カラーの設定
void SetColorQuad(QUADRANGLE *quad, D3DCOLOR setColor);

// 四角形２Ｄポリゴンの初期化
void InitQuad(QUADRANGLE *quad, int sizeX, int sizeY);





#endif
