//=============================================================================
//
// スコア処理 [score.h]
// Author : HAL東京昼間部 2年制ゲーム学科 GP11B341 24 中込和輝
//
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_


//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"


//*****************************************************************************
// マクロ・列挙型定義
//*****************************************************************************
#define ADD_SCORE_VALUE			(100)


//*****************************************************************************
// 構造体定義
//*****************************************************************************
// スコア構造体
struct GAMESCORE {
	LPDIRECT3DTEXTURE9			pTexture;					// テクスチャへのポインタ
	VERTEX_2D					vertexWk[NUM_VERTEX];		// 頂点情報格納ワーク
	D3DXVECTOR3					pos;						// 座標
	D3DXVECTOR3					rot;						// 回転

	int							value;						// スコア値
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// スコアの初期化処理
HRESULT InitScore(int type);
// スコアの終了処理
void UninitScore(void);
// スコアの更新処理
void UpdateScore(void);
// スコアの描画処理
void DrawScore(void);
// スコアを加算
void AddScore(int addValue);



#endif