//=============================================================================
//
// タイマー処理 [timer.h]
// Author : HAL東京昼間部 2年制ゲーム学科 GP11B341 24 中込和輝
//
//=============================================================================
#ifndef _TIMER_H_
#define _TIMER_H_


//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"


//*****************************************************************************
// マクロ・列挙型定義
//*****************************************************************************


//*****************************************************************************
// 構造体定義
//*****************************************************************************
// タイマー構造体
struct GAMETIMER {
	LPDIRECT3DTEXTURE9			pTexture;					// テクスチャへのポインタ
	VERTEX_2D					vertexWk[NUM_VERTEX];		// 頂点情報格納ワーク
	D3DXVECTOR3					pos;						// 座標
	D3DXVECTOR3					rot;						// 回転

	DWORD						currentTime;				// 現在のシステム時刻
	DWORD						lastTime;					// 表示タイムを前回更新した際のシステム時刻
	int							displayTime;				// 表示タイム

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// タイマーの初期化処理
HRESULT InitTimer(int type);
// タイマーの終了処理
void UninitTimer(void);
// タイマーの更新処理
void UpdateTimer(void);
// タイマーの描画処理
void DrawTimer(void);


#endif